13/data/attachments/b51ee3820ff62718.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bcde9c55-436a-4e41-8d8d-46f647aec26f</nif:username>
            <nif:friendToBeAdded>Brittany_friend_Friend_44848_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>